hints = ['Короткий сон приводит к \nповышенной смертности, \n возникновению диабета, \nпроблемам с сердечнососудистой \nсистемой, ишемической болезни сердца,\n ожирению. Идеальное время сна\n - 7-8 часов.',
'Отход ко сну и \nпробуждение постоянно в разное время\n приводят к худшей успеваемости в учёбе,\n к плохому самочувствию и сбитым \nциркадным ритмам. Также повышается\n риск развития всех видов болезней.\n Оптимально ложиться в 9-10 вечера\n и вставать в 5-6 утра.',
'Восприятие света во время сна\nнегативно сказывается на его\n качестве: период глубокого\nсна уменьшается, появляются ночные\n пробуждения. Сон становится поверх-\nностным, неглубоким. Увеличивается время\n пробуждения. Появляются различные\n нарушения сна. Советуем купить\n беруши и маску для сна',
'Если выпить кофе за 30-60 \nминут до сна, то спать \nбудешь меньше, а также \nуменьшится продолжительность\n глубокого сна.',
'Приём алкоголя ассоциируют с\n расстройствами сна и настроения.',
'Медитация уменьшает уровень кортизола\n в крови, что понижает стресс и \nриск всех заболеваний ему сопутствующих.',
'Спите в прохладе: идеальная \nтемпература в спальне во \nвремя сна - 17-18 градусов.',
'Принимайте горячий душ\n примерно за час до сна: \nэто помогает организму охладиться.',
'Для охлождения во время сна\n также можно купить подушку с \nтеплоотведением. Это также действенный\n метод улучшения качества сна.',
'Бывайте на солнце по утрам: доказано что\n солнечный свет помогает организму\n настроить циркадные ритмы и, \nследовательно, лучше спать. Также свет\n от солнца рано утром улучшает уровни\n дофамина, серотонина, тестостерона',
'Занимайтесь физкультурой. Согласно\n этому исследование спорт\n улучшает качество сна',
'Согласно этому исследованию, идеальная\n поза для сна - на боку. Так ваш\n организм будет эффективнее \nвсего очищать мозг от загрязнений.',
'Хорошим решением для улучшения качества\n сна будет отказ от гаджетов\n за час до сна. Подумайте: это \nведь тоже источник света. Также \nнастоятельно советуем установить на \nтелефоне и компьютере ночной режим по \nрасписанию(это когда у вас экран оранжевый).'
]

links = ['https://pubmed.ncbi.nlm.nih.gov/27743803/ ',
'https://pubmed.ncbi.nlm.nih.gov/12220314/',
'https://sci-hub.se/10.1016/j.sleep.2013.09.007',
'https://pubmed.ncbi.nlm.nih.gov/11404278/',
'https://pubmed.ncbi.nlm.nih.gov/11404278/',
'https://pubmed.ncbi.nlm.nih.gov/23724462/',
'https://www.ncbi.nlm.nih.gov/pmc/articles/PMC4853167/',
'https://jcsm.aasm.org/doi/abs/10.5664/jcsm.9180',
'https://link.springer.com/article/10.1007%2Fs00484-003-0181-3',
'https://www.frontiersin.org/articles/10.3389/fphys.2020.00005/full',
'https://www.ncbi.nlm.nih.gov/pmc/articles/PMC5696653/',
'https://www.jneurosci.org/content/35/31/11034',
'https://academic.oup.com/sleepadvances/article/1/1/zpaa002/5851240?login=false'
]
