hints = ['Короткий сон приводит к \nповышенной смертности, \n возникновению диабета, \nпроблемам с сердечнососудистой \nсистемой, ишемической болезни сердца,\n ожирению. Идеальное время сна\n - 7-8 часов.',
'Отход ко сну и \nпробуждение постоянно в разное время приводят \nк худшей успеваемости в учёбе, к плохому \nсамочувствию и сбитым циркадным ритмам.\n Также повышается риск развития всех видов болезней.\n Оптимально ложиться в 9-10 вечера и вставать в 5-6 утра.',
'Восприятие света во время сна негативно\n сказывается на его качестве: период глубокого \nсна уменьшается, появляются ночные пробуждения.\n Сон становится поверхностным, неглубоким.\n Увеличивается время пробуждения.\n Появляются различные нарушения сна.'
]

links = ['https://pubmed.ncbi.nlm.nih.gov/27743803/ ',
'https://pubmed.ncbi.nlm.nih.gov/12220314/',
'https://sci-hub.se/10.1016/j.sleep.2013.09.007'
]
