hints = ['Короткий сон приводит к \nповышенной смертности, \n возникновению диабета, \nпроблемам с сердечнососудистой \nсистемой, ишемической болезни\n сердца, ожирению. Идеальное\n время сна - 7-8 часов.',
'Отход ко сну и \nпробуждение постоянно в\n разное время приводят к\n худшей успеваемости в учёбе,\n к плохому самочувствию\n и сбитым циркадным ритмам.\n Также повышается риск развития\n всех видов болезней.\n Оптимально ложиться в \n9-10 вечера и вставать \nв 5-6 утра.',
'Восприятие света во время\n сна негативно сказывается\n на его качестве: период\n глубокого сна уменьшается,\n появляются ночные пробуждения.\n Сон становится поверх-\nностным, неглубоким. Увеличивается\n время пробуждения. Появляются\n различные нарушения сна.\n Советуем купить\n беруши и маску для сна',
'Если выпить кофе за\n 30-60 минут до сна,\n то спать будешь\n меньше, а также \nуменьшится продолжи-\n-тельность глубокого сна.',
'Приём алкоголя ассоциируют с\n расстройствами сна \nи настроения.',
'Медитация уменьшает \nуровень кортизола в\n крови, что понижает\n стресс и риск всех\n заболеваний ему\n сопутствующих.',
'Спите в прохладе:\n идеальная температура\n в спальне во время\n сна - 17-18 градусов.',
'Принимайте горячий\n душ примерно за час \nдо сна: это помогает\n организму охладиться.',
'Для охлождения во\n время сна также можно\n купить подушку с \nтеплоотведением. Это также\n действенный метод\n улучшения качества сна.',
'Бывайте на солнце\n по утрам: доказано что\n солнечный свет помогает\n организму настроить\n циркадные ритмы и,\n следовательно, лучше\n спать. Также свет\n от солнца рано утром\n улучшает уровни\n дофамина, серотонина,\n тестостерона',
'Занимайтесь физкультурой.\n Согласно этому исследование\n спорт улучшает качество сна',
'Согласно этому\n исследованию, идеальная\n поза для сна - на боку.\n Так ваш организм будет \nэффективнее всего очищать\n мозг от загрязнений.',
'Хорошим решением для\n улучшения качества сна\n будет отказ от гаджетов\n за час до сна. Подумайте:\n это ведь тоже источник\n света. Также настоятельно\n советуем установить на \nтелефоне и компьютере\n ночной режим по \nрасписанию(это когда у вас\n экран оранжевый).'
]

links = ['https://pubmed.ncbi.nlm.nih.gov/27743803/ ',
'https://pubmed.ncbi.nlm.nih.gov/12220314/',
'https://sci-hub.se/10.1016/j.sleep.2013.09.007',
'https://pubmed.ncbi.nlm.nih.gov/11404278/',
'https://pubmed.ncbi.nlm.nih.gov/11404278/',
'https://pubmed.ncbi.nlm.nih.gov/23724462/',
'https://www.ncbi.nlm.nih.gov/pmc/articles/PMC4853167/',
'https://jcsm.aasm.org/doi/abs/10.5664/jcsm.9180',
'https://link.springer.com/article/10.1007%2Fs00484-003-0181-3',
'https://www.frontiersin.org/articles/10.3389/fphys.2020.00005/full',
'https://www.ncbi.nlm.nih.gov/pmc/articles/PMC5696653/',
'https://www.jneurosci.org/content/35/31/11034',
'https://academic.oup.com/sleepadvances/article/1/1/zpaa002/5851240?login=false'
]
